<template>
    <div>
      <div class="title-frame">
        <h1 class="mothertext">
          การกระตุ้น
          <span class="heart-box">ทารก</span>
            </h1>
        </div>
        <v-row class="title-frame">
            <v-col cols="6">
                <div class="left-content">
                    <h1 class="section-title">วิธีกระตุ้นพัฒนาการ สร้างลูกฉลาดตั้งแต่ในครรภ์</h1>
                    <p>
                        กระตุ้นพัฒนาการ ทารกในครรภ์ เริ่มต้นเมื่อไหร่ดี
                        นับตั้งแต่กระบวนการปฏิสนธิโดยสมบูรณ์ ไข่ผสมกับสเปิร์มและสร้างเป็นตัวอ่อน สิ่งมีชีวิตเล็ก ๆ
                        ภายในท้องของคุณแม่ก็เริ่มพัฒนาต่อเนื่องไปเรื่อย ๆ
                        และสร้างระบบอวัยวะต่างมากมายรวมทั้งเซลล์สมองที่มีการเพิ่มทั้งจำนวนและขนาด
                        เกิดเป็นเนื้อสมองและเส้นใยประสาทที่เชื่อมโยงกับสมองและเชื่อมโยงกันเองเกิดเป็นข่ายใยเส้นประสาทอย่างมากและรวดเร็วเพื่อทำหน้าที่ต่าง
                        ๆ ดังนั้นช่วงทองที่คุณแม่จะกระตุ้นพัฒนาการของสมองลูกน้อยสามารถเริ่มได้ตั้งแต่อยู่ในครรภ์ตลอด 9
                        เดือนกันเลย
                    </p>
                    <p>1.ลูบหน้าท้องกระตุ้นความรู้สึก</p>
                    <p>
                        ช่วงไตรมาสแรกแม้ทารกจะเป็นตัวอ่อนอยู่ แต่ภายในเดือนที่ 2 ทารกจะเริ่มรับรู้สัมผัสทางกายได้
                        การที่คุณแม่ได้สัมผัสหน้าท้องหรือลูบท้องเบา ๆ จะทำให้ทารกรู้สึกได้ถึงแรงสั่นสะท้อน
                        ช่วยกระตุ้นระบบประสาทและสมองส่วนรับรู้ความรู้สึกของลูกให้มีพัฒนาการดีขึ้น นอกจากนี้ความรัก
                        ความอบอุ่นที่ผ่านจากปลายมือเหมือนกำลังสัมผัสร่างกายส่วนต่าง ๆ
                        ของลูกน้อยที่ช่วยให้คุณแม่รู้สึกใกล้ชิดกับเจ้าต้วน้อยในท้องมากขึ้น และการส่งเสียงทักทายพูดคุยกับเบา
                        ๆ ที่ทำให้คุณแม่มีความสุขในช่วงเวลานี้
                        ร่างกายจะหลั่งสารเอนโดรฟินหรือสารแห่งความสุขจะถูกส่งผ่านไปทางสายสะดือไปยังทารกในครรภ์
                        จะทำให้ลูกน้อยเป็นเด็กอารมณ์ดี เลี้ยงง่าย มีพัฒนาการที่ดีทั้ง IQ และ EQ
                    </p>
                    <p>2.อ่านหนังสือให้ลูกฟังกระตุ้นพัฒนาการสมองของลูกน้อย</p>
                    <p>
                        สิ่งที่น่าอัศจรรย์ระหว่างชีวิตน้อย ๆ ในท้องกับคุณแม่ก็คือการได้ยินกันและกันผ่านผนังหน้าท้อง
                        แม้ว่าลูกจะอยู่ภายในอีกด้านหนึ่ง แต่ก็สามารถสัมผัสสิ่งเหล่านี้ได้
                        โดยทารกในครรภ์จะเริ่มได้ยินเสียงได้ดีตั้งแต่เดือนที่ 5
                        ดังนันเพื่อเป็นการกระตุ้นพัฒนาการสมองของลูกน้อยด้วยวิธีง่าย ๆ
                        เพียงแค่คุณแม่หยิบหนังสือขึ้นมาอ่านออกเสียงให้ลูกได้ฟัง ใช้เวลาซัก 30 นาทีหรือก่อนนอน เช่น นิทานเด็ก
                        หนังสือวรรณกรรมเด็กและเยาวชน หรือคู่มือเลี้ยงลูก เป็นต้น
                        เสียงสะท้อนจากคุณแม่จะกระตุ้นการสร้างเนื้อเยื่อสมองในชั้นที่มีความซับซ้อนด้านการได้ยิน
                        การตีความเสียง และส่วนของความทรงจำ ที่มีส่วนช่วยให้ลูกมีพัฒนาการได้เร็ว
                        ยิ่งโดยเฉพาะเมื่อคุณแม่อ่านหนังสือด้วยการใช้โทนเสียงที่มีจังหวะสูงต่ำเหมือนการเล่านิทานให้เด็ก ๆ ฟัง
                        และเอามือแตะท้องเบา ๆ ไปด้วยในขณะอ่าน ก็ยิ่งเป็นการกระตุ้นพัฒนาการให้ลูกตอบสนองกับเสียงของแม่ไปด้วย
                        และนอกจากลูกน้อยจะได้พัฒนาการที่ดีจากการที่คุณแม่อ่านหนังสือให้ฟังแล้ว
                        ลูกยังได้คุ้นชินกับเสียงของคุณแม่ตั้งแต่ในครรภ์ ความรู้สึกที่ส่งผ่านไปจะทำให้ลูกผ่อนคลาย อารมณ์ดี
                        มีแนวโน้มที่เป็นเด็กที่เลี้ยงง่ายอีกด้วย
                    </p>
                    <p>3.เล่นหน้าท้องกระตุ้นลูกดิ้น</p>
                    <p>
                        นอกจากการสัมผัสหน้าท้อง ลูบหน้าท้องเบา ๆ ที่คุณพ่อกับคุณแม่สามารถทำได้บ่อย ๆ ตลอดการตั้งครรภ์
                        ในช่วงไตรมาสที่ 2 คุณแม่จะรับรู้ได้ถึงการดิ้นของลูก ในขณะที่ลูกดิ้นหรือโก่งตัวเคลื่อนไปมา
                        คุณแม่อาจตอบสนองโดยใช้มือเล่นหน้าท้องกับลูกด้วยการลูบให้แรงขึ้น
                        โดยวนเป็นวงกลมจากบนลงล่างหรือจากล่างขึ้นบนก่อนก็ได้ หรือใช้นิ้วจิ้มไปยังจุดที่ลูกเคลื่อนไหว
                        หากจังหวะนั้นลูกในท้องมีปฏิกิริยาตอบรับ มีการเคลื่อนที่หรือดิ้นไปยังทิศทางหนึ่ง
                        แสดงว่าลูกมีการตอบสนองจากสิ่งเร้าที่คุณแม่สร้างให้ ซึ่งมีส่วนช่วยกระตุ้นพัฒนาสมอง
                        เพิ่มเติมความฉลาดให้กับลูกน้อยในท้องได้อีกวิธี
                    </p>
                </div>
            </v-col>
            <v-col cols="6">
                <div class="right-content">
                    <v-card class="mx-auto card-with-animation" max-width="700" @mouseenter="startCardAnimation"
                        @mouseleave="stopCardAnimation">
                        <v-img src="../assets/in/2.jpg" height="100%"></v-img>
                    </v-card>
                </div>
                <div class="right-content">
                    <v-card class="mx-auto card-with-animation" max-width="700" @mouseenter="startCardAnimation"
                        @mouseleave="stopCardAnimation">
                        <v-img src="../assets/1.jpg" height="100%"></v-img>
                    </v-card>
                </div>
            </v-col>
        </v-row>
        <v-row class="title-frame">
            <v-col cols="6">
                <div class="right-content">
                    <v-card class="mx-auto card-with-animation" max-width="700" @mouseenter="startCardAnimation"
                        @mouseleave="stopCardAnimation">
                        <v-img src="../assets/in/3.webp" height="100%"></v-img>
                    </v-card>
                </div>
                <div class="right-content">
                    <v-card class="mx-auto card-with-animation" max-width="700" @mouseenter="startCardAnimation"
                        @mouseleave="stopCardAnimation">
                        <v-img src="../assets/in/4.jpg" height="100%"></v-img>
                    </v-card>
                </div>
            </v-col>
            <v-col cols="6">
                <div class="right-content">
                    <p>4.ให้ลูกน้อยฟังเพลงกระตุ้นพัฒนาการได้ยิน
                    </p>
                    <p>
                        ลูกน้อยในครรภ์จะเริ่มได้ยินตั้งแต่อายุครรภ์เดือนที่ 5 หูของทารกในครรภ์จะมีความสมบูรณ์ในสัปดาห์ที่ 20
                        และเริ่มต้นรับรู้ถึงแรงสั่นสะเทือนได้ในสัปดาห์ที่ 24 ได้ยินเสียงในสัปดาห์ที่ 30
                        สามารถแยกแยะเสียงได้ในสัปดาห์ที่ 34
                        ซึ่งระบบประสาทการรับฟังถือว่าเป็นพัฒนาการด้านประสาทสัมผัสของเด็กที่พัฒนาในอับดับต้น ๆ
                        ดังนั้นเสียงต่าง ๆ
                        จากภายนอกก็จะมีส่วนช่วยกระตุ้นให้เครือข่ายใยประสาทที่ทำงานเกี่ยวกับการได้ยินของลูกมีพัฒนาการดีขึ้น
                        โดยเฉพาะเสียงเพลง หากเปิดดนตรีให้ลูกได้ฟังในระหว่างตั้งครรภ์ ประมาณ 10-15 นาที/วัน
                        เปิดเสียงเพลงให้อยู่ห่างจากหน้าท้องประมาณ 1 ฟุต และเปิดเสียงดังพอประมาณ
                        คลื่นเสียงจะไปกระตุ้นการได้ยินให้พัฒนาระบบการทำงานได้เร็วขึ้น
                        ทั้งนี้คุณแม่สามารถเปิดเพลงในแนวที่คุณแม่ชอบฟังหรือเพลงที่มีทำนองไพเพราะ ท่วงทำนองฟังสบาย
                        อย่างเพลงคลาสสิคที่ขึ้นว่ามีส่วนช่วยเพิ่มไอคิวเสริมสร้างพัฒนาการทำให้สมองดี เฉลียวฉลาด
                        และจดจำสิ่งต่าง ๆ ได้ดี
                        อีกทั้งเมื่อลูกน้อยที่ได้ยินเสียงผ่านผนังหน้าท้องอาจจะมีการตอบสนองต่อเสียงเพลงด่วยการเคลื่อนไหว
                        ซึ่งถือว่าเป็นการช่วยกระตุ้นพัฒนาการทางกายได้เป็นอย่างดีอีกด้วย
                    </p>
                    <p>5.ชวนลูกคุยบ่อย ๆ กระตุ้นพัฒนาการได้ยิน ภาษา และอารมณ์</p>
                    <p>
                        ในระยะไตรมาสที่สองของการตั้งครรภ์ โดยเฉพาะในเดือนที่ 6
                        ที่ระบบประสาทที่เกี่ยวข้องกับการได้ยินของทารกเริ่มทำงานได้เต็มที่ ซึ่งจะเห็นได้ว่าการอ่านหนังสือ
                        เปิดเพลงให้ลูกฟังล้วนมีส่วนช่วยกระตุ้นพัฒนาการการได้ยินของลูกน้อย
                        และอีกหนึ่งวิธีที่คุณพ่อคุณแม่จะช่วยส่งเสริมพัฒนาการทางด้านนี้ได้ดียิ่งขึ้น
                        และเตรียมพร้อมสำหรับการได้ยินหลังคลอด คือ การพูดคุยกับลูกในท้องบ่อย ๆ
                        เสียงพูดของคุณพ่อคุณแม่จะส่งผ่านเข้าไปถึงลูกน้อยช่วยกระตุ้นพัฒนาการการได้ยิน รับรู้ แยกแยะเสียง
                        และทำให้ทารกในครรภ์มีทักษะด้านภาษาและสื่อสารตั้งแต่ยังไม่ได้คลอด
                        ทั้งนี้ทารกสามารถจำเสียงคุณพ่อคุณแม่ได้ตั้งแต่อยู่ในท้องด้วย หลังคลอดหากทารกงอแง หงุดหงิดง่าย
                        เมื่อได้ยินเสียงของคุณพ่อคุณแม่ก็อาจทำให้ลูกน้อยสงบลงได้ง่ายขึ้น
                        ไม่เพียงเท่านี้การพูดคุยกับลูกน้อยในครรภ์ยังเป็นการเชื่อมสายใยรัก
                        ความผูกพันระหว่างพ่อแม่ลูกให้แน่นแฟ้นยิ่งขึ้น
                    </p>
                    <p>6.ส่องไฟฉายกระตุ้นพัฒนาการการมองเห็น</p>
                    <p>
                        ตั้งแต่อายุครรภ์ประมาณ 7 เดือนทารกในครรภ์สามารถลืมตา กระพริบตา รับรู้แสง มองเห็นแสง
                        และแยกความแตกต่างระหว่างความมืดและความสว่างได้แล้ว
                        ในระยะนี้คุณพ่อคุณแม่สามารถช่วยกระตุ้นพัฒนาการด้านการมองเห็นให้กับลูกน้อยด้วยการใช้ไฟฉายส่องที่หน้าท้อง
                        เปิดปิดไฟแบบกะพริบ ๆ เพื่อให้แสงเคลื่อนที่บนล่างอย่างช้า ๆ ผ่านหน้าท้องไปที่น้ำคร่ำ
                        เล่นกับลูกด้วยวิธีวันละ 5-10 ครั้งประมาณ 1-2 นาที
                        ซึ่งลูกอาจจะมีการตอบสนองแสงไฟด้วยการดิ้นให้คุณแม่รับรู้ได้
                        การส่องไฟที่หน้าท้องนี้จะทำให้เซลล์สมองและเส้นประสาทส่วนรับภาพและการมองเห็นของทารกมีพัฒนาดีขึ้น
                        และเตรียมพร้อมสำหรับการมองเห็นของทารกในภายหลังคลอด
                    </p>
                </div>
            </v-col>
        </v-row>
    </div>
</template>
  
<style>
.section-title {
    font-size: 28px;
    color: #333;
    font-weight: bold;
    text-decoration: underline;
    padding-bottom: 10px;
    border: 1px solid #ddd;
    padding: 10px;
    box-shadow: 0 0 10px rgba(0, 0, 0, 0.1);
}

.left-content {
    padding: 20px;
}

.right-content {
    padding: 20px;
}

.image-container {
    text-align: center;
}

.card-with-animation {
    transition: transform 0.5s ease-in-out;
}

.card-with-animation:hover {
    transform: scale(1.05);
}

.mothertext {
    display: flex;
    flex-wrap: wrap;
    justify-content: center;
    align-items: center;
    margin-top: 50px;
    margin-bottom: 50px;
}

.card-with-animation {
    transition: transform 0.3s ease;
}

.card-with-animation.animated {
    transform: scale(1.1);
}

.image-container {
    display: flex;
    flex-wrap: wrap;
    justify-content: flex;
}

.image-container2 {
    display: flex;
    flex-wrap: wrap;
    justify-content: flex;
    margin-top: 60px;
}

.mothertext {
    text-align: center;
    margin-top: 50px;
    margin-bottom: 50px;
    font-size: 28px;
}

@keyframes textAnimation {
    0% {
        transform: scale(1);
    }

    25% {
        transform: scale(1.1);
    }

    50% {
        transform: scale(0.9);
    }

    75% {
        transform: scale(1.1);
    }

    100% {
        transform: scale(1);
    }
}

.title-frame h1 {
    font-size: px;
    margin: 0;
}

.top-left-image {
    position: absolute;
    top: 0;
    left: 0;
    width: 20%;
}

.top-right-image {
    position: absolute;
    top: 0;
    right: 0;
    width: 20%;
}

.title-frame {
    border: 2px solid #ddd;
    padding: 20px;
    box-shadow: 0 0 10px rgba(0, 0, 0, 0.1);
    text-align: center;
    margin-top: 50px;
    margin-bottom: 50px;
    transition: transform 0.5s ease-in-out;
}

.title-frame:hover {
    transform: scale(1.05);
}

.mothertext {
    font-size: 28px;
    color: #333;
    font-family: 'Fredoka One', cursive;
    animation: textAnimation 1s ease-in-out;
}

.heart-box {
    color: #ff69b4;
    font-weight: bold;
    animation: heartbeat 2s infinite;
}
</style>
  
<script>
export default {
    name: 'Conduct',
    methods: {
        startCardAnimation(event) {
            const card = event.target;
            card.classList.add('animated');
        },

        stopCardAnimation(event) {
            const card = event.target;
            card.classList.remove('animated');
        },
    },
};
</script>
  